debug-artifacts/load-tests/20260410T102719Z-fixed-full-suite/console/eu-smoke.log
[k6] K6 version: k6 v0.53.0 (commit/f82a27da8f, go1.22.6, linux/amd64)
[k6] Pre-flight: checking https://35.244.162.92.nip.io/nginx-health ...
[k6] Results will be written to: json=debug-artifacts/load-tests/20260410T102719Z-fixed-full-suite/metrics/eu-smoke.json

╔══════════════════════════════════════════════════╗
║         VCS K6 LOAD TEST RUNNER                ║
╚══════════════════════════════════════════════════╝

[k6] Scenario  : SMOKE
[k6] Target    : https://35.244.162.92.nip.io
[k6] Results   : /home/ajinkyataranekar26/distributed-vehicle-capacity-system/scripts/load-testing/results/summary-smoke-20260410T103946.json

[k6] Running: k6 run --out json=debug-artifacts/load-tests/20260410T102719Z-fixed-full-suite/metrics/eu-smoke.json --summary-export /home/ajinkyataranekar26/distributed-vehicle-capacity-system/scripts/load-testing/results/summary-smoke-20260410T103946.json --env K6_SCENARIO=smoke --env BASE_URL=https://35.244.162.92.nip.io /home/ajinkyataranekar26/distributed-vehicle-capacity-system/scripts/load-testing/k6-load-test.js


          /\      |‾‾| /‾‾/   /‾‾/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ‾‾\  
   /          \   |  |\  \ |  (‾)  | 
  / __________ \  |__| \__\ \_____/ .io

     execution: local
        script: /home/ajinkyataranekar26/distributed-vehicle-capacity-system/scripts/load-testing/k6-load-test.js
        output: json (debug-artifacts/load-tests/20260410T102719Z-fixed-full-suite/metrics/eu-smoke.json)

     scenarios: (100.00%) 1 scenario, 1 max VUs, 1m0s max duration (incl. graceful stop):
              * smoke: 1 looping VUs for 30s (gracefulStop: 30s)

time="2026-04-10T10:39:46Z" level=info msg="\n============================================================" source=console
time="2026-04-10T10:39:46Z" level=info msg="VCS Load Test — Scenario: SMOKE" source=console
time="2026-04-10T10:39:46Z" level=info msg="Base URL: https://35.244.162.92.nip.io" source=console
time="2026-04-10T10:39:46Z" level=info msg="============================================================\n" source=console

running (0m01.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
smoke   [   3% ] 1 VUs  01.0s/30s

running (0m02.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
smoke   [   7% ] 1 VUs  02.0s/30s

running (0m03.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
smoke   [  10% ] 1 VUs  03.0s/30s

running (0m04.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
smoke   [  13% ] 1 VUs  04.0s/30s

running (0m05.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
smoke   [  17% ] 1 VUs  05.0s/30s

running (0m06.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
smoke   [  20% ] 1 VUs  06.0s/30s

running (0m07.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
smoke   [  23% ] 1 VUs  07.0s/30s

running (0m08.0s), 1/1 VUs, 1 complete and 0 interrupted iterations
smoke   [  27% ] 1 VUs  08.0s/30s

running (0m09.0s), 1/1 VUs, 1 complete and 0 interrupted iterations
smoke   [  30% ] 1 VUs  09.0s/30s

running (0m10.0s), 1/1 VUs, 1 complete and 0 interrupted iterations
smoke   [  33% ] 1 VUs  10.0s/30s

running (0m11.0s), 1/1 VUs, 1 complete and 0 interrupted iterations
smoke   [  37% ] 1 VUs  11.0s/30s

running (0m12.0s), 1/1 VUs, 1 complete and 0 interrupted iterations
smoke   [  40% ] 1 VUs  12.0s/30s

running (0m13.0s), 1/1 VUs, 1 complete and 0 interrupted iterations
smoke   [  43% ] 1 VUs  13.0s/30s

running (0m14.0s), 1/1 VUs, 1 complete and 0 interrupted iterations
smoke   [  47% ] 1 VUs  14.0s/30s

running (0m15.0s), 1/1 VUs, 1 complete and 0 interrupted iterations
smoke   [  50% ] 1 VUs  15.0s/30s

running (0m16.0s), 1/1 VUs, 1 complete and 0 interrupted iterations
smoke   [  53% ] 1 VUs  16.0s/30s

running (0m17.0s), 1/1 VUs, 2 complete and 0 interrupted iterations
smoke   [  57% ] 1 VUs  17.0s/30s

running (0m18.0s), 1/1 VUs, 2 complete and 0 interrupted iterations
smoke   [  60% ] 1 VUs  18.0s/30s

running (0m19.0s), 1/1 VUs, 2 complete and 0 interrupted iterations
smoke   [  63% ] 1 VUs  19.0s/30s

running (0m20.0s), 1/1 VUs, 2 complete and 0 interrupted iterations
smoke   [  67% ] 1 VUs  20.0s/30s

running (0m21.0s), 1/1 VUs, 2 complete and 0 interrupted iterations
smoke   [  70% ] 1 VUs  21.0s/30s

running (0m22.0s), 1/1 VUs, 2 complete and 0 interrupted iterations
smoke   [  73% ] 1 VUs  22.0s/30s

running (0m23.0s), 1/1 VUs, 2 complete and 0 interrupted iterations
smoke   [  77% ] 1 VUs  23.0s/30s

running (0m24.0s), 1/1 VUs, 2 complete and 0 interrupted iterations
smoke   [  80% ] 1 VUs  24.0s/30s

running (0m25.0s), 1/1 VUs, 2 complete and 0 interrupted iterations
smoke   [  83% ] 1 VUs  25.0s/30s

running (0m26.0s), 1/1 VUs, 3 complete and 0 interrupted iterations
smoke   [  87% ] 1 VUs  26.0s/30s

running (0m27.0s), 1/1 VUs, 4 complete and 0 interrupted iterations
smoke   [  90% ] 1 VUs  27.0s/30s

running (0m28.0s), 1/1 VUs, 4 complete and 0 interrupted iterations
smoke   [  93% ] 1 VUs  28.0s/30s

running (0m29.0s), 1/1 VUs, 4 complete and 0 interrupted iterations
smoke   [  97% ] 1 VUs  29.0s/30s

running (0m30.0s), 1/1 VUs, 4 complete and 0 interrupted iterations
smoke   [ 100% ] 1 VUs  30.0s/30s

running (0m31.0s), 1/1 VUs, 4 complete and 0 interrupted iterations
smoke ↓ [ 100% ] 1 VUs  30s

running (0m32.0s), 1/1 VUs, 4 complete and 0 interrupted iterations
smoke ↓ [ 100% ] 1 VUs  30s

running (0m33.0s), 1/1 VUs, 4 complete and 0 interrupted iterations
smoke ↓ [ 100% ] 1 VUs  30s

running (0m34.0s), 1/1 VUs, 4 complete and 0 interrupted iterations
smoke ↓ [ 100% ] 1 VUs  30s

running (0m35.0s), 1/1 VUs, 4 complete and 0 interrupted iterations
smoke ↓ [ 100% ] 1 VUs  30s
time="2026-04-10T10:40:21Z" level=info msg="\n============================================================" source=console
time="2026-04-10T10:40:21Z" level=info msg="Test complete — Scenario: smoke" source=console
time="2026-04-10T10:40:21Z" level=info msg="Target: https://35.244.162.92.nip.io" source=console
time="2026-04-10T10:40:21Z" level=info msg="Circuit breaker trips detected: check circuit_breaker_trips metric" source=console
time="2026-04-10T10:40:21Z" level=info msg="============================================================\n" source=console

     █ auth: register

       ✓ register: status 201 or 409

     █ auth: get profile

       ✓ profile: status 200
       ✓ profile: has email

     █ map: search places

       ✓ search: status 200 or 429

     █ map: get route

       ✓ route: status 200

     █ capacity: check availability

       ✓ segments: status 200
       ✓ segments: is array

     █ capacity: occupancy

       ✓ occupancy: status 200

     █ journey: create

       ✓ journey create: status 201/200/409/422
       ✓ journey create: not 5xx (except 503)

     █ health: gateway

       ✓ nginx healthy: status 200

   ✓ auth_success...................: 100.00% ✓ 5        ✗ 0  
   ✓ capacity_check_duration........: avg=401ms    min=238ms    med=452ms    max=462ms    p(90)=461.7ms  p(95)=461.85ms
     checks.........................: 100.00% ✓ 44       ✗ 0  
     data_received..................: 373 kB  11 kB/s
     data_sent......................: 11 kB   315 B/s
     group_duration.................: avg=355.64ms min=4.32ms   med=283.77ms max=1.39s    p(90)=837.39ms p(95)=1.12s   
     http_req_blocked...............: avg=401.99µs min=368ns    med=728ns    max=7.3ms    p(90)=935ns    p(95)=2.49ms  
     http_req_connecting............: avg=32.33µs  min=0s       med=0s       max=540.68µs p(90)=0s       p(95)=222.35µs
   ✗ http_req_duration..............: avg=343.59ms min=4.08ms   med=275.55ms max=1.39s    p(90)=827.65ms p(95)=1.1s    
       { expected_response:true }...: avg=343.59ms min=4.08ms   med=275.55ms max=1.39s    p(90)=827.65ms p(95)=1.1s    
   ✓ http_req_failed................: 0.00%   ✓ 0        ✗ 32 
     http_req_receiving.............: avg=109.37ms min=77.6µs   med=154.55µs max=813.09ms p(90)=409.62ms p(95)=445.93ms
     http_req_sending...............: avg=126.19µs min=67.95µs  med=114.91µs max=263.53µs p(90)=181.12µs p(95)=207.14µs
     http_req_tls_handshaking.......: avg=322.78µs min=0s       med=0s       max=5.5ms    p(90)=0s       p(95)=2.17ms  
     http_req_waiting...............: avg=234.09ms min=3.91ms   med=35.49ms  max=1.37s    p(90)=718.72ms p(95)=1.1s    
     http_reqs......................: 32      0.912933/s
     iteration_duration.............: avg=5s       min=169.92µs med=7.69s    max=9.78s    p(90)=9.1s     p(95)=9.44s   
     iterations.....................: 5       0.142646/s
   ✓ journey_create_success.........: 100.00% ✓ 4        ✗ 0  
   ✓ route_compute_duration.........: avg=286.25ms min=151ms    med=293ms    max=408ms    p(90)=386.1ms  p(95)=397.04ms
     vus............................: 1       min=1      max=1
     vus_max........................: 1       min=1      max=1


running (0m35.1s), 0/1 VUs, 5 complete and 0 interrupted iterations
smoke ✓ [ 100% ] 1 VUs  30s
time="2026-04-10T10:40:21Z" level=error msg="thresholds on metrics 'http_req_duration' have been crossed"